/* -*- Mode: C++; indent-tabs-mode: nil -*- */
#ifndef SCHWA_MSGPACK_WIRE_IMPL_H_
#define SCHWA_MSGPACK_WIRE_IMPL_H_

#include <cassert>
#include <limits>

#include <schwa/io/traits.h>
#include <schwa/mpl/if.h>
#include <schwa/msgpack/dynamic.h>
#include <schwa/msgpack/exception.h>
#include <schwa/msgpack/wire.h>
#include <schwa/port.h>


namespace schwa {
  namespace msgpack {

    constexpr const WireType HEADER_TYPES[256] = {
      WireType::FIXINT_POSITIVE, WireType::FIXINT_POSITIVE, WireType::FIXINT_POSITIVE, WireType::FIXINT_POSITIVE, WireType::FIXINT_POSITIVE, WireType::FIXINT_POSITIVE, WireType::FIXINT_POSITIVE, WireType::FIXINT_POSITIVE,
      WireType::FIXINT_POSITIVE, WireType::FIXINT_POSITIVE, WireType::FIXINT_POSITIVE, WireType::FIXINT_POSITIVE, WireType::FIXINT_POSITIVE, WireType::FIXINT_POSITIVE, WireType::FIXINT_POSITIVE, WireType::FIXINT_POSITIVE,
      WireType::FIXINT_POSITIVE, WireType::FIXINT_POSITIVE, WireType::FIXINT_POSITIVE, WireType::FIXINT_POSITIVE, WireType::FIXINT_POSITIVE, WireType::FIXINT_POSITIVE, WireType::FIXINT_POSITIVE, WireType::FIXINT_POSITIVE,
      WireType::FIXINT_POSITIVE, WireType::FIXINT_POSITIVE, WireType::FIXINT_POSITIVE, WireType::FIXINT_POSITIVE, WireType::FIXINT_POSITIVE, WireType::FIXINT_POSITIVE, WireType::FIXINT_POSITIVE, WireType::FIXINT_POSITIVE,

      WireType::FIXINT_NEGATIVE, WireType::FIXINT_NEGATIVE, WireType::FIXINT_NEGATIVE, WireType::FIXINT_NEGATIVE, WireType::FIXINT_NEGATIVE, WireType::FIXINT_NEGATIVE, WireType::FIXINT_NEGATIVE, WireType::FIXINT_NEGATIVE,
      WireType::FIXINT_NEGATIVE, WireType::FIXINT_NEGATIVE, WireType::FIXINT_NEGATIVE, WireType::FIXINT_NEGATIVE, WireType::FIXINT_NEGATIVE, WireType::FIXINT_NEGATIVE, WireType::FIXINT_NEGATIVE, WireType::FIXINT_NEGATIVE,
    };

    namespace header {
      constexpr const unsigned char FIXINT_POSITIVE = 0x7f;
      constexpr const unsigned char MAP_FIXED       = 0x80;
      constexpr const unsigned char ARRAY_FIXED     = 0x90;
      constexpr const unsigned char STR_FIXED       = 0xa0;
      constexpr const unsigned char NIL             = 0xc0;
      constexpr const unsigned char RESERVED        = 0xc1;
      constexpr const unsigned char FALSE           = 0xc2;
      constexpr const unsigned char TRUE            = 0xc3;
      constexpr const unsigned char BIN_8           = 0xc4;
      constexpr const unsigned char BIN_16          = 0xc5;
      constexpr const unsigned char BIN_32          = 0xc6;
      constexpr const unsigned char EXT_8           = 0xc7;
      constexpr const unsigned char EXT_16          = 0xc8;
      constexpr const unsigned char EXT_32          = 0xc9;
      constexpr const unsigned char FLOAT           = 0xca;
      constexpr const unsigned char DOUBLE          = 0xcb;
      constexpr const unsigned char UINT_8          = 0xcc;
      constexpr const unsigned char UINT_16         = 0xcd;
      constexpr const unsigned char UINT_32         = 0xce;
      constexpr const unsigned char UINT_64         = 0xcf;
      constexpr const unsigned char INT_8           = 0xd0;
      constexpr const unsigned char INT_16          = 0xd1;
      constexpr const unsigned char INT_32          = 0xd2;
      constexpr const unsigned char INT_64          = 0xd3;
      constexpr const unsigned char EXT_FIXED_8     = 0xd4;
      constexpr const unsigned char EXT_FIXED_16    = 0xd5;
      constexpr const unsigned char EXT_FIXED_32    = 0xd6;
      constexpr const unsigned char EXT_FIXED_64    = 0xd7;
      constexpr const unsigned char EXT_FIXED_128   = 0xd8;
      constexpr const unsigned char STR_8           = 0xd9;
      constexpr const unsigned char STR_16          = 0xda;
      constexpr const unsigned char STR_32          = 0xdb;
      constexpr const unsigned char ARRAY_16        = 0xdc;
      constexpr const unsigned char ARRAY_32        = 0xdd;
      constexpr const unsigned char MAP_16          = 0xde;
      constexpr const unsigned char MAP_32          = 0xdf;
      constexpr const unsigned char FIXINT_NEGATIVE = 0xff;
    }


    // ========================================================================
    // Host <--> big endian low level functions.
    // ========================================================================
    template <typename IN, typename T>
    inline void
    _read_be8(IN &in, T *const h8) {
      static_assert(sizeof(T) == 1, "wrong sized pointer target");
      uint8_t be8;
      in.read(reinterpret_cast<char *>(&be8), 1);
      if (SCHWA_UNLIKELY(in.gcount() != 1))
        throw ReadError("Failed to read data", in.gcount(), 1);
      *reinterpret_cast<uint8_t *>(h8) = be8;
    }

    template <typename IN, typename T>
    inline void
    _read_be16(IN &in, T *const h16) {
      static_assert(sizeof(T) == 2, "wrong sized pointer target");
      uint16_t be16;
      in.read(reinterpret_cast<char *>(&be16), 2);
      if (SCHWA_UNLIKELY(in.gcount() != 2))
        throw ReadError("Failed to read data", in.gcount(), 2);
      *reinterpret_cast<uint16_t *>(h16) = port::be16_to_h(be16);
    }

    template <typename IN, typename T>
    inline void
    _read_be32(IN &in, T *const h32) {
      static_assert(sizeof(T) == 4, "wrong sized pointer target");
      uint32_t be32;
      in.read(reinterpret_cast<char *>(&be32), 4);
      if (SCHWA_UNLIKELY(in.gcount() != 4))
        throw ReadError("Failed to read data", in.gcount(), 4);
      *reinterpret_cast<uint32_t *>(h32) = port::be32_to_h(be32);
    }

    template <typename IN, typename T>
    inline void
    _read_be64(IN &in, T *const h64) {
      static_assert(sizeof(T) == 8, "wrong sized pointer target");
      uint64_t be64;
      in.read(reinterpret_cast<char *>(&be64), 8);
      if (SCHWA_UNLIKELY(in.gcount() != 8))
        throw ReadError("Failed to read data", in.gcount(), 8);
      *reinterpret_cast<uint64_t *>(h64) = port::be64_to_h(be64);
    }

    template <typename OUT, typename T>
    inline void
    _write_be8(OUT &out, const T *const h8) {
      static_assert(sizeof(T) == 1, "wrong sized pointer target");
      const uint8_t be8 = *reinterpret_cast<const uint8_t *>(h8);
      out.write(reinterpret_cast<const char *>(&be8), 1);
    }

    template <typename OUT, typename T>
    inline void
    _write_be16(OUT &out, const T *const h16) {
      static_assert(sizeof(T) == 2, "wrong sized pointer target");
      const uint16_t be16 = port::h_to_be16(*reinterpret_cast<const uint16_t *>(h16));
      out.write(reinterpret_cast<const char *>(&be16), 2);
    }

    template <typename OUT, typename T>
    inline void
    _write_be32(OUT &out, const T *const h32) {
      static_assert(sizeof(T) == 4, "wrong sized pointer target");
      const uint32_t be32 = port::h_to_be32(*reinterpret_cast<const uint32_t *>(h32));
      out.write(reinterpret_cast<const char *>(&be32), 4);
    }

    template <typename OUT, typename T>
    inline void
    _write_be64(OUT &out, const T *const h64) {
      static_assert(sizeof(T) == 8, "wrong sized pointer target");
      const uint64_t be64 = port::h_to_be64(*reinterpret_cast<const uint64_t *>(h64));
      out.write(reinterpret_cast<const char *>(&be64), 8);
    }


    // ========================================================================
    // Helper functions.
    // ========================================================================
    template <size_t NBYTES, typename IN, typename OUT>
    inline void
    _read_write_nbytes(IN &in, OUT &out) {
      static_assert(NBYTES != 0, "nbytes must be positive");
      char buf[NBYTES];
      in.read(buf, NBYTES);
      if (SCHWA_UNLIKELY(in.gcount() != NBYTES))
        throw ReadError("Failed to read data", in.gcount(), NBYTES);
      out.write(buf, NBYTES);
    }


    // ========================================================================
    // Type traits.
    // ========================================================================
    namespace traits {
